Overall I agree with the changes proposed, besides the specific issues I pointed out. Unfortunately even after fixing those issues this change would require essentially a complete recreation of all related infrastructure.

Most of the resources are not stateful (security groups, IAM, load balancers, task definitions, etc.), thus are not harmful to destroy and recreate with better naming conventions, but the RDS instance and buckets for osquery results/status in addition to file carving would all be recreated and thus any state lost. In scenarios where someone was using the above terraform to manage their Fleet infrastructure, that might be a very unexpected terraform plan output.

For example:
```
  # module.aurora_mysql.aws_rds_cluster_instance.this[0] must be replaced
-/+ resource "aws_rds_cluster_instance" "this" {
      ~ arn                             = "OMITTED" -> (known after apply)
      ~ availability_zone               = "us-east-2c" -> (known after apply)
      ~ cluster_identifier              = "fleetdm-mysql-iam" -> (known after apply) # forces replacement
      ~ db_parameter_group_name         = "fleetdm-aurora-db-mysql-parameter-group" -> (known after apply)
      ~ db_subnet_group_name            = "fleetdm-mysql-iam" -> "fleetdm-fleet-mysql-iam" # forces replacement
      ~ dbi_resource_id                 = "OMITTED" -> (known after apply)
      ~ endpoint                        = "OMITTED" -> (known after apply)
      ~ engine_version_actual           = "5.7.mysql_aurora.2.10.0" -> (known after apply)
      ~ id                              = "fleetdm-mysql-iam-1" -> (known after apply)
      ~ identifier                      = "fleetdm-mysql-iam-1" -> "fleetdm-fleet-mysql-iam-1" # forces replacement
      + identifier_prefix               = (known after apply)
      ~ kms_key_id                      = "OMITTED" -> (known after apply)
      ~ monitoring_role_arn             = "OMITTED" -> (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      ~ port                            = 3306 -> (known after apply)
      ~ preferred_backup_window         = "02:00-03:00" -> (known after apply)
      ~ storage_encrypted               = true -> (known after apply)
      - tags                            = {} -> null
      ~ tags_all                        = {} -> (known after apply)
      ~ writer                          = true -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket.osquery-status must be replaced
-/+ resource "aws_s3_bucket" "osquery-status" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::fleet-osquery-status-archive" -> (known after apply)
      ~ bucket                      = "fleet-osquery-status-archive" -> "fleetdm-fleet-osquery-status-archive" # forces replacement
      ~ bucket_domain_name          = "fleet-osquery-status-archive.s3.amazonaws.com" -> (known after apply)


```


We'll need to come up with a way to properly migrate these resources or at least guidelines for folks that are trying to keep in lock-step with the current terraform.

This could probably be accomplished with a series of move commands https://www.terraform.io/cli/commands/state/mv

@zwinnerman-fleetdm any thoughts?
 